{
  "player": {
    "index": "player",
    "name": "Alexa the All Knowing",
    "health": 100,
    "strength": 30,
    "defense": 40,
    "detailed_description": "Player description",
    "location": "ship_storeroom",
    "inventory": [
    ],
    "isAlive": true,
    "equippedWeapon": "plasma_rifle"
  },
  "npcs": [
    {
      "index": "guardian",
      "name": "Ancient Guardian",
      "detailed_description": "The Guardian of the Starstone is a colossal entity, ancient and wise, positioned in the heart of the Whispering Valleys. Its form is a convergence of ethereal energies, resembling a towering silhouette with luminescent patterns that dance across its surface. The Guardian exudes a sense of both formidable strength and serene guardianship over the mystical Starstone.",
      "health": 100,
      "strength": 30,
      "defense": 20,
      "location": "mountains",
      "inventory": [
        "elixir",
        "gravity_hammer",
        "starstone"
      ],
      "isAlive": true,
      "equippedWeapon": "gravity_hammer",
      "hostile": true,
      "dialogueOptions": ["Let's get on with this so you can win the game."],
      "questDetails": "",
      "hidden": false
    },
    {
      "index": "sandshifter",
      "name": "Sandshifter",
      "detailed_description": "The Sandshifter is a formidable creature that prowls the shifting dunes, its presence a testament to adaptation in the harsh environment. The creature's body is covered in a textured, sandstone-like skin, featuring intricate patterns that mimic the desert's dunes.",
      "health": 50,
      "strength": 40,
      "defense": 20,
      "location": "desert",
      "inventory": ["crystal"],
      "isAlive": true,
      "equippedWeapon": "",
      "hostile": true,
      "dialogueOptions": [
        "Do you really want to talk? I just want to fight!"
      ],
      "questDetails": "",
      "hidden": false
    },
    {
      "index": "luminara_speaker",
      "name": "Luminara Speaker",
      "health": 100,
      "strength": 10,
      "defense": 100,
      "detailed_description": "The Luminara Speaker is a regal figure in the heart of Luminara City, adorned in luminescent robes that mirror the city's vibrant hues. Standing atop a raised platform, the Speaker emanates an aura of wisdom and authority, symbolizing a connection to the cosmic energies that flow through the advanced alien civilization. A tall, elegant headdress adorned with luminescent jewels frames their face, accentuating an air of regality.",
      "location": "city_center",
      "inventory": [],
      "isAlive": true,
      "equippedWeapon": "",
      "hostile": false,
      "dialogueOptions": [
        "Greetings, brave interstellar traveler. Your plight has not gone unnoticed. How may the Luminara assist you?",
        "I have a healing elixir to trade for a Sandshifter crystal unless I have already given it to you",
        "The Sandshifters live in the Glass Desert"
      ],
      "questDetails": "",
      "hidden": false
    }
  ]
}