{
  "items": [
    {
      "index": "starstone",
      "type": "item",
      "name": "Starstone",
      "description": "The Starstone is a radiant mineral. Its surface shimmers with a luminosity that mirrors the celestial energies of the alien world. A rare and ancient gem, the Starstone possesses an ethereal beauty that captivates all who behold it.",
      "detailed_description": "The Starstone's significance transcends its aesthetic brilliance; it is the key to interstellar journeying. Within its core lies the potential to power spacecraft engines and traverse the vastness of the cosmos. As one gazes upon the Starstone, there's a profound sense of connection to the mysteries of the alien world, an acknowledgment of the celestial forces that converge within this radiant mineral. Maybe someone knows what other mysterious powers it may have.",
      "usable": true,
      "active": true,
      "hidden": false,
      "movable": true,
      "hasSound": false,
      "useText": "You position the Starstone within a specially designed chamber at the core of the ship's engines. The hum of the spacecraft's machinery intensifies as the mineral comes into contact with the engine's components, creating a resonance that echoes through the engine room. As the Starstone integrates with the engine, the spacecraft seems to come alive with renewed energy. Soft vibrations pulse through the ship, and the once-damaged engines emit a thrum of revitalized power.             \nYou initiate the launch sequence. The spacecraft, now infused with the cosmic energy of the Starstone, ascends gracefully into the alien sky. The city below fades into the distance as the ship breaches the atmosphere, leaving the luminescent tapestry of Luminara behind.                     \nThe interstellar journey home begins, and as the spacecraft hurtles through the cosmos, you gaze at the starlit expanse, grateful for the transformative experience that will forever be etched into the tapestry of your existence. The Starstone, a luminescent key, unlocks the doors to the vastness of the universe, guiding the way back to the familiar constellations of home.",
      "useLocation": "ship_engine"
    },
    {
      "index": "ore",
      "type": "item",
      "name": "mountain ore",
      "description": "The ore found within the mineral-rich mountains is a marvel of extraterrestrial composition. Its raw form, extracted from the heart of the alien peaks, reveals a metallic substance that defies earthly expectations. The ore is a fusion of crystalline structures and resilient alloys, reflecting the unique geological processes of the alien world.",
      "detailed_description": "In the context of crafting and repair, the ore proves to be a versatile resource. Its malleability allows for shaping into specialized panels, providing structural reinforcement for the damaged spacecraft. When integrated into the hull, the ore not only repairs but enhances the vessel, creating a symbiotic relationship between human engineering and the resilient essence of the alien landscape. The ore stands as a beacon of adaptability, a bridge between the known and the unknown in the interstellar odyssey.",
      "usable": true,
      "active": true,
      "hidden": true,
      "movable": true,
      "hasSound": true,
      "useText": "You begin the process of integrating the mountain ore into the damaged sections. The ore, shaped into specialized panels, fits seamlessly into the hull. \nAs the last piece of mountain ore is secured into place, the spacecraft's hull undergoes a transformation. The repaired sections now glisten with a faint luminescence, a testament to the harmonious integration of the alien material. The repaired hull stands as a visual narrative of adaptation, resilience, and the interplay between the challenges faced and the resources found in the mountainous terrain.",
      "useLocation": "crash_site"
    },
    {
      "index": "mining_laser",
      "type": "weapon",
      "name": "mining laser",
      "description": "Compact and versatile, the laser emits a focused beam of intense energy.",
      "detailed_description": "The exterior of the mining laser is sleek and ergonomic, featuring a control panel with intuitive interfaces for adjusting energy levels and beam precision. The device is crafted from advanced materials, allowing for ease of use during resource extraction. A soft hum emanates from the laser when activated, a testament to the potent energy harnessed within.",
      "usable": true,
      "active": true,
      "hidden": false,
      "movable": true,
      "hasSound": true,
      "damage": 10,
      "range": 10,
      "durability": 10,
      "useText": "The mining laser is equipped with advanced targeting systems, allowing you to pinpoint specific veins of ore embedded within the rocky terrain. As the laser beam converges on its target, a radiant glow envelops the selected area, revealing the mineral deposits hidden within the craggy surfaces of the mountains.",
      "useLocation": "ship_storeroom"
    },
    {
      "index": "ship_scanner",
      "type": "item",
      "name": "Ship's Scanners",
      "description": "The ship's scanners are a marvel of advanced technology, seamlessly blending precision with adaptability to navigate the complexities of the alien world.",
      "detailed_description": "Nestled within the control room, these scanners are a vital tool for your exploration, offering a comprehensive understanding of the surrounding environment. The primary scanner interface manifests as a holographic display, suspended in the air before your control station. The display is a multi-dimensional canvas, capable of rendering detailed maps, energy signatures, and environmental analyses.",
      "usable": true,
      "active": true,
      "hidden": false,
      "movable": false,
      "hasSound": true,
      "useText": "You activate the scanners to assess the environmental conditions outside. The holographic displays come to life, presenting a comprehensive analysis of the alien world's energy emissions. A energy spike in the mountains to the east seems interesting.",
      "useLocation": "ship_control"
    },
    {
      "index": "journal",
      "type": "item",
      "name": "Journal",
      "description": "The journal is a compact, weathered book, its pages filled with handwritten entries and sketches.",
      "detailed_description": "Your journal is a tangible chronicle of the interstellar odyssey, a repository of thoughts, observations, and reflections that capture the essence of the alien world. It documents the diverse landscapes, encounters, and experiences since you arrived on this planet.",
      "usable": true,
      "active": true,
      "hidden": false,
      "movable": false,
      "hasSound": true,
      "useText": "Your journal would be used to save game data in a future release.",
      "useLocation": ""
    },
    {
      "index": "elixir",
      "type": "item",
      "name": "Healing Elixir",
      "description": "The elixir glows with a subtle light.",
      "detailed_description": "The healing elixir, crafted by the Luminara Trader, eliminates a subtle glow and warmth. It will restore you, body and mind.",
      "usable": true,
      "active": true,
      "hidden": false,
      "movable": true,
      "hasSound": true,
      "useText": "As you consume the Luminescent Tranquility Elixir, a gentle wave of calm envelops you, like a soothing breeze in the midst of cosmic turmoil. As the elixir takes effect, a soft glow emanates from your being—a manifestation of the healing energies at play. The Luminescent Tranquility Elixir becomes a beacon of light within, dispelling the shadows of fatigue and revitalizing the spirit. The soothing energy extends to every cell, mending the subtle fractures of interstellar exploration.",
      "useLocation": ""
    },
    {
      "index": "crystal",
      "type": "item",
      "name": "crystal",
      "description": "This crystal is very rare and hard to find",
      "detailed_description": "This crystal seems special, give it to the Luminara speaker to get something in return.",
      "usable": true,
      "active": true,
      "hidden": false,
      "movable": true,
      "hasSound": false,
      "useText": "Precious to the Luminara",
      "useLocation": ""
    },
    {
      "index": "plasma_rifle",
      "type": "weapon",
      "name": "Plasma Rifle",
      "description": "A high-tech rifle emitting concentrated plasma bursts.",
      "detailed_description": "This rifle harnesses the power of ionized gas, emitting powerful bursts of plasma. Ideal for long-range combat in the vacuum of space, it combines futuristic design with lethal efficiency.",
      "usable": false,
      "active": true,
      "hidden": false,
      "movable": true,
      "hasSound": true,
      "damage": 15,
      "range": 20,
      "durability": 50,
      "useText": "The Plasma Rifle crackles with energy as you aim. Releasing a shot, a blazing trail of plasma arcs towards its target, burning through obstacles with ease.",
      "useLocation": ""
    },
    {
      "index": "gravity_hammer",
      "type": "weapon",
      "name": "Gravity Hammer",
      "description": "A formidable melee weapon manipulating gravitational fields.",
      "detailed_description": "This hammer is a masterpiece of engineering, using localized gravity fields to magnify its impact. It's a symbol of strength and power, capable of unleashing devastating blows that can disrupt enemy defenses.",
      "usable": false,
      "active": true,
      "hidden": false,
      "movable": true,
      "hasSound": true,
      "damage": 20,
      "range": 5,
      "durability": 40,
      "useText": "Swinging the Gravity Hammer creates a visible distortion in the air, and upon impact, it releases a shockwave that sends adversaries reeling.",
      "useLocation": ""
    }
  ]
}